loadtests/login/sustain.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 500
      arrivalRate: 100
      name: "Sustained load"
 
scenarios:
  - name: "Login workflow flow"
    flow:
      - post:
          url: "/api/users/signin"
          json:
            email: "admin@example.com"
            password: "1234"
      - think: 1
      - get:
          url: "/api/products"